In [1]:
import pandas as pd

In [4]:
data=pd.read_csv("CRO.csv")

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 316200 entries, 0 to 316199
Data columns (total 6 columns):
country                316200 non-null object
age                    316200 non-null int64
new_user               316200 non-null int64
source                 316200 non-null object
total_pages_visited    316200 non-null int64
converted              316200 non-null int64
dtypes: int64(4), object(2)
memory usage: 14.5+ MB

In [6]:
data.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 316200 entries, 0 to 316199
Data columns (total 6 columns):
country                316200 non-null object
age                    316200 non-null int64
new_user               316200 non-null int64
source                 316200 non-null object
total_pages_visited    316200 non-null int64
converted              316200 non-null int64
dtypes: int64(4), object(2)
memory usage: 46.0 MB

In [7]:
data.memory_usage()

Index                       80
country                2529600
age                    2529600
new_user               2529600
source                 2529600
total_pages_visited    2529600
converted              2529600
dtype: int64

In [9]:
data.memory_usage(deep=True)

Index                        80
country                18950886
age                     2529600
new_user                2529600
source                 19189260
total_pages_visited     2529600
converted               2529600
dtype: int64

In [10]:
data.memory_usage(deep=True).sum()

48258626

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 316200 entries, 0 to 316199
Data columns (total 6 columns):
country                316200 non-null object
age                    316200 non-null int64
new_user               316200 non-null int64
source                 316200 non-null object
total_pages_visited    316200 non-null int64
converted              316200 non-null int64
dtypes: int64(4), object(2)
memory usage: 14.5+ MB

In [14]:
sorted(data.country.unique())

['China', 'Germany', 'UK', 'US']

In [15]:
data.country.head()

0       UK
1       US
2       US
3    China
4       US
Name: country, dtype: object

In [16]:
data.dtypes

country                object
age                     int64
new_user                int64
source                 object
total_pages_visited     int64
converted               int64
dtype: object

In [17]:
data["country"]=data["country"].astype("category")

In [18]:
data.dtypes

country                category
age                       int64
new_user                  int64
source                   object
total_pages_visited       int64
converted                 int64
dtype: object

In [19]:
data.country.head()

0       UK
1       US
2       US
3    China
4       US
Name: country, dtype: category
Categories (4, object): [China, Germany, UK, US]

In [20]:
data.country.cat.codes.head()

0    2
1    3
2    3
3    0
4    3
dtype: int8

In [22]:
data.memory_usage(deep=True).sum()

29624184

In [23]:
data.country.cat.categories

Index(['China', 'Germany', 'UK', 'US'], dtype='object')

In [24]:
df=pd.DataFrame({"id":[100,101,102,103],"quality":["good","very good","good","excellent"]})

In [25]:
df

    id    quality
0  100       good
1  101  very good
2  102       good
3  103  excellent

In [28]:
df.sort_values("quality")

    id    quality
3  103  excellent
0  100       good
2  102       good
1  101  very good

In [29]:
df["quality"]=df.quality.astype("category",categories=["good","very good","excellent"],ordered=True)

In [30]:
df

    id    quality
0  100       good
1  101  very good
2  102       good
3  103  excellent

In [31]:
df.sort_values("quality")

    id    quality
0  100       good
2  102       good
1  101  very good
3  103  excellent

In [32]:
df.loc[df.quality > "good",:]

    id    quality
1  101  very good
3  103  excellent

In [33]:
df.to_csv("sub")

In [34]:
help(pd.to_pickle)

Help on function to_pickle in module pandas.io.pickle:

to_pickle(obj, path)
    Pickle (serialize) object to input file path

    Parameters
    ----------
    obj : any object
    path : string
        File path

In [35]:
df.to_pickle("kisd")

In [36]:
pd.read_pickle("kisd")

    id    quality
0  100       good
1  101  very good
2  102       good
3  103  excellent

In [37]:
data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0

In [39]:
data.isnull().head()

  country    age new_user source total_pages_visited converted
0   False  False    False  False               False     False
1   False  False    False  False               False     False
2   False  False    False  False               False     False
3   False  False    False  False               False     False
4   False  False    False  False               False     False

In [40]:
data.notnull().head()

  country   age new_user source total_pages_visited converted
0    True  True     True   True                True      True
1    True  True     True   True                True      True
2    True  True     True   True                True      True
3    True  True     True   True                True      True
4    True  True     True   True                True      True

In [41]:
data.columns

Index(['country', 'age', 'new_user', 'source', 'total_pages_visited',
       'converted'],
      dtype='object')

In [42]:
data.loc[0:4,:]#label based indexing

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0

In [43]:
data.iloc[0:4,:]#positonal based indexing

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0

In [44]:
data.values[0:4,:]

array([['UK', 25, 1, 'Ads', 1, 0],
       ['US', 23, 1, 'Seo', 5, 0],
       ['US', 28, 1, 'Seo', 4, 0],
       ['China', 39, 1, 'Seo', 5, 0]], dtype=object)

In [45]:
data.sample(n=3)

       country  age  new_user  source  total_pages_visited  converted
227268   China   23         0  Direct                   14          0
111861      US   50         0     Seo                    2          0
175823   China   41         1     Ads                    1          0

In [46]:
data.sample(n=3)

       country  age  new_user  source  total_pages_visited  converted
217415      US   23         1  Direct                    2          0
135257   China   19         1     Seo                    4          0
149113   China   26         0     Ads                    9          0

In [47]:
data.sample(n=3,random_state=42)

       country  age  new_user  source  total_pages_visited  converted
85100       UK   19         1     Ads                    2          0
273946   China   37         1  Direct                    1          0
275452      US   40         1     Seo                    7          0

In [48]:
data.sample(n=3,random_state=42)

       country  age  new_user  source  total_pages_visited  converted
85100       UK   19         1     Ads                    2          0
273946   China   37         1  Direct                    1          0
275452      US   40         1     Seo                    7          0

In [49]:
data.sample(n=3,random_state=92)

       country  age  new_user source  total_pages_visited  converted
33188       US   22         1    Seo                    4          0
103590   China   34         1    Seo                    6          0
121915      US   27         1    Ads                    1          0

In [50]:
data.sample(n=3,random_state=92)

       country  age  new_user source  total_pages_visited  converted
33188       US   22         1    Seo                    4          0
103590   China   34         1    Seo                    6          0
121915      US   27         1    Ads                    1          0

In [53]:
data.sample(frac=0.50,random_state=54).count()

country                158100
age                    158100
new_user               158100
source                 158100
total_pages_visited    158100
converted              158100
dtype: int64

In [54]:
train=data.sample(frac=0.50,random_state=54)

In [55]:
test=data.loc[~data.index.isin(train.index),:]

In [56]:
test.shape

(158100, 6)

In [57]:
data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0

In [58]:
data.isnull().sum()

country                0
age                    0
new_user               0
source                 0
total_pages_visited    0
converted              0
dtype: int64

In [59]:
data.notnull().sum()

country                316200
age                    316200
new_user               316200
source                 316200
total_pages_visited    316200
converted              316200
dtype: int64